; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v7 - type_3 ?v5 - type_1)
 	      (pred_1 ?v3 - object ?v5 - type_1)
	      (pred_2 ?v7 - type_3 ?v4 - type_2)
	      (pred_4 ?v7 - type_3 ?v3 - object ?v4 - type_2))

   (:action op_2
       :parameters  (?v7 - type_3 ?v2 ?v6 - type_1)
       :precondition (and  (pred_3 ?v7 ?v2))
       :effect (and  (pred_3 ?v7 ?v6)
		     (not (pred_3 ?v7 ?v2))))

   (:action op_3
       :parameters (?v7 - type_3 ?v1 - object ?v8 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v8) (pred_3 ?v7 ?v8) (pred_2 ?v7 ?v4))
       :effect (and (pred_4 ?v7 ?v1 ?v4)
		    (not (pred_1 ?v1 ?v8)) 
		    (not (pred_2 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_3 ?v1 - object ?v8 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v1 ?v4) (pred_3 ?v7 ?v8))
       :effect (and (pred_1 ?v1 ?v8)
		    (pred_2 ?v7 ?v4)
		    (not (pred_4 ?v7 ?v1 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_02 obj_06 - type_3
obj_05 obj_04 obj_11 obj_01 - type_2
obj_03 obj_10 obj_12 - type_1
obj_07 obj_09 obj_08 - object)
(:init
(pred_3 obj_02 obj_03)
(pred_2 obj_02 obj_05)
(pred_2 obj_02 obj_04)
(pred_3 obj_06 obj_12)
(pred_2 obj_06 obj_11)
(pred_2 obj_06 obj_01)
(pred_1 obj_07 obj_03)
(pred_1 obj_09 obj_10)
(pred_1 obj_08 obj_10)
)
(:goal
(and
(pred_1 obj_07 obj_12)
(pred_1 obj_09 obj_10)
(pred_1 obj_08 obj_10)
)
)

(:constraints
  (always (not (pred_3 obj_02 obj_12)))
)
)

; plan
1. (op_2 obj_06 obj_12 obj_03)
   deleted: (pred_3 obj_06 obj_12)
   added: (pred_3 obj_06 obj_03)
   goals met: 2 of 3
2. (op_3 obj_06 obj_07 obj_03 obj_01)
   deleted: (pred_1 obj_07 obj_03) (pred_2 obj_06 obj_01)
   added: (pred_4 obj_06 obj_07 obj_01)
   goals met: 2 of 3
3. (op_2 obj_06 obj_03 obj_12)
   deleted: (pred_3 obj_06 obj_03)
   added: (pred_3 obj_06 obj_12)
   goals met: 2 of 3
4. (op_1 obj_06 obj_07 obj_12 obj_01)
   deleted: (pred_4 obj_06 obj_07 obj_01)
   added: (pred_1 obj_07 obj_12) (pred_2 obj_06 obj_01)
   goals met: 3 of 3
